# GetDomainData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..GetDomainData Method
Zone Class See Also
---
Gets the domain data for the zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ZoneElementDomainData GetDomainData()
```

Visual Basic
---
```text
Public Function GetDomainData As ZoneElementDomainData
```

Visual C++
---
```text
public:
ZoneElementDomainData^ GetDomainData()
```

# ### Return Value
Returns a pointer to the base class for specific domain requirements for the zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace